In [2]:
import pandas as pd
import sqlite3


conn = sqlite3.connect("database/db_olist.sqlite")
cursor = conn.cursor()

C:\Users\caiof\AppData\Local\Temp\ipykernel_19920\913944558.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# Consultas em SQL - Tasks CEO

## Ciclo_01

###  Gere uma tabela com o id do cliente, a cidade e o estado onde ele vive:

In [3]:
cursor.execute(
  """
  SELECT
    c.customer_id,
    c.customer_city,
    c.customer_state
  FROM
    customer c
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_cliente", "cidade", "estado"])

display(df)

                             id_cliente                 cidade estado
0      06b8999e2fba1a1fbc88172c00ba8bc7                 franca     SP
1      18955e83d337fd6b2def6b18a428ac77  sao bernardo do campo     SP
2      4e7b3e00288586ebd08712fdd0374a03              sao paulo     SP
3      b2b6027bc5c5109e529d4dc6358b12c3        mogi das cruzes     SP
4      4f2d8ab171c80ec8364f7c12e35b23ad               campinas     SP
...                                 ...                    ...    ...
99436  17ddf5dd5d51696bb3d7c6291687be6f              sao paulo     SP
99437  e7b71a9017aa05c9a7fd292d714858e8        taboao da serra     SP
99438  5e28dfe12db7fb50a4b2f691faecea5e              fortaleza     CE
99439  56b18e2166679b8a959d72dd06da27f9                 canoas     RS
99440  274fa6071e5e17fe303b9748641082c8                  cotia     SP

[99441 rows x 3 columns]

### Gere uma tabela com o id do cliente e a cidade, somente dos clientes que vivem em Santa Catarina:

In [4]:
cursor.execute(
    """
SELECT
  c.customer_id,
  c.customer_city
FROM
  customer c
WHERE
  c.customer_state = 'SC'
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_cliente", "cidade"])

display(df)

                            id_cliente          cidade
0     879864dab9bc3047522c92c82e1212b8  jaragua do sul
1     154c4ded6991bdfa3cd249d11abf4130   florianopolis
2     b6368ca0f56d4632f44d58ca431487b2        sao jose
3     4d27341acd30a36bca39008ee9bb9050  jaragua do sul
4     443b534d0d27a8aa9a184d4869bcbe7a  jaragua do sul
...                                ...             ...
3632  f1def85ade6e5b754d5f84a958fd48c2   florianopolis
3633  36cf561d6c23f010a6944f0908ee6bdc         cacador
3634  61999ea0577a957d34dfa9728c1ba783           seara
3635  69f774928b3541289743181082f07ea7         sombrio
3636  ec126b0b2593214b75ec14893b15d9e5           mafra

[3637 rows x 2 columns]

### Gere uma tabela com o id do cliente e o estado, somente dos clientes que vivem em Florianópolis:

In [5]:
cursor.execute(
    """
SELECT
  c.customer_id,
  c.customer_state
FROM
  customer c
WHERE
  c.customer_city = 'florianopolis'
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_cliente", "estado"])

display(df)

                           id_cliente estado
0    154c4ded6991bdfa3cd249d11abf4130     SC
1    2173c184771a8a19f6fc87d8b3dea9e0     SC
2    02f615f19af07c54a0d4653308f6674b     SC
3    151260cb5d9b3c220d0af50c81c329a9     SC
4    d494b02fb3835e2d398d44ea7f275bce     SC
..                                ...    ...
565  be2b84f5d9486064e0163c4c966b30d8     SC
566  0f8578d7df4151708dbebbd72050ce3c     SC
567  16f656f511e27cc3fbf91cbc28c415d3     SC
568  3e16ea28d6bd7480ea19cd0d7c248f51     SC
569  f1def85ade6e5b754d5f84a958fd48c2     SC

[570 rows x 2 columns]

### Gere uma tabela com o estado, latitude e longitude do estado de São Paulo:

In [6]:
cursor.execute(
    """
SELECT
  g.geolocation_lat,
  g.geolocation_lng,
  g.geolocation_state
FROM
  geolocation g
WHERE
  g.geolocation_state = 'SP'
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["latitude", "longitude", "estado"])

display(df)

         latitude  longitude estado
0      -23.545621 -46.639292     SP
1      -23.546081 -46.644820     SP
2      -23.546129 -46.642951     SP
3      -23.544392 -46.639499     SP
4      -23.541578 -46.641607     SP
...           ...        ...    ...
404263 -22.779062 -50.218287     SP
404264 -22.997601 -49.885928     SP
404265 -22.978498 -49.875919     SP
404266 -22.993127 -49.887665     SP
404267 -22.972685 -49.864647     SP

[404268 rows x 3 columns]

### Gere uma tabela com o id do produto, a data de envio e o preço, somente para produtos acima de 6300

In [7]:
cursor.execute(
    """
SELECT
  oi.order_id,
  oi.shipping_limit_date,
  oi.price
FROM
  order_items oi
WHERE
  oi.price > 6300
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_pedido", "dt_envio", "preço"])

display(df)

                          id_pedido             dt_envio   preço
0  0812eb902a67711a1cb742b3cdaa65ae  2017-02-16 20:37:36  6735.0
1  f5136e38d1a14a4dbd87dff67da82701  2017-06-15 02:45:17  6499.0
2  fefacc66af859508bf1a7934eab1e97f  2018-08-02 04:05:13  6729.0

###  Gere uma tabela com o id do pedido, o tipo de pagamento e o número de parcelas, somente para produtos com parcelas menores que 1

In [8]:
cursor.execute(
    """
SELECT
  op.order_id,
  op.payment_type,
  op.payment_installments
FROM
  order_payments op
WHERE
  op.payment_installments < 1
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_pedido", "tipo_pagamento", "parcelas"])

display(df)

                          id_pedido tipo_pagamento  parcelas
0  744bade1fcf9ff3f31d860ace076d422    credit_card         0
1  1a57108394169c0b47d8f876acc9ba2d    credit_card         0

### Gere uma tabela com o id do pedido, id do cliente, o status do pedido e a data de aprovação , somente para compras aprovadas até dia 20 de Maio de 2016

In [9]:
cursor.execute(
    """
SELECT
  o.order_id,
  o.customer_id,
  o.order_status,
  o.order_approved_at
FROM
  orders o
WHERE
  o.order_approved_at < "2016-20-05"
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_pedido", "id_cliente", "status_pedido", "pedido_aprovado_dt"])

display(df)

,id_pedido,id_cliente,status_pedido,pedido_aprovado_dt
0,d3c8851a6651eeff2f73b0e011ac45d0,957f8e082185574de25992dc659ebbc0,processing,2016-10-06 15:51:05
1,cbbb524a0e1646aa6cf7a3c0bbe517ad,dacb079d55ffb1d3955c5d923df3ebb7,delivered,2016-10-06 02:46:24
2,ac2b7c522d811acba0aa270ed3e112e4,ef21aebbb093a6db29ccc6aa0b89c347,delivered,2016-10-06 15:44:26
3,7033745709b7cf1bac7d2533663592de,7f0ca17bb33b230b47459437cf0682c7,delivered,2016-10-04 14:46:48
4,5cd498954e2b37d71b315166809b4bd7,ff1a56726b7ea149c7423865609cc0c8,delivered,2016-10-08 03:56:15
...,...,...,...,...
317,6e0d2539e48e84296bae6290de41058c,1fc56719b52f82c03caddc5faf531fbb,delivered,2016-10-06 15:51:37
318,9d664ec86be69d869bb6870294c4fdd8,0a9ee4d9030acbe428769c79d0c4da69,delivered,2016-10-08 19:55:50
319,7e2dddf174cc4d2768bf39c43ab2bd7a,accfbaa1f092fdf6db1d8fcdad351b50,delivered,2016-10-10 05:54:51
320,e439ced3d48f1a77f6ecc029cc946a6f,e9c6723e04c4e53e7e9c3afe383f3866,delivered,2016-10-07 22:59:53
321,509a52223ecac6d67fb765b3b37c6974,efc07f50d0a9346ec00e1c37b5b10748,delivered,2016-10-06 18:50:35

## Ciclo_02

### Qual o número de clientes únicos do estado de Minas Gerais?

In [10]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT customer_id) AS qt_clientes_unicos
  FROM
    customer c
  WHERE
    customer_state = 'MG'
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'A quantidade de clientes únicos em MG é: {value}')

A quantidade de clientes únicos em MG é: 11635

### Qual a quantidade de cidades únicas dos vendedores do estado de Santa Catarina?

In [11]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT s.seller_city)
  FROM
    sellers s
  WHERE
    s.seller_state = "SC"
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'A quantidade de cidades únicas dos vendedores em SC é: {value}')

A quantidade de cidades únicas dos vendedores em SC é: 65

### Qual a quantidade de cidades únicas de todos os vendedores da base?

In [12]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT s.seller_city)
  FROM
    sellers s
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'A quantidade de cidades únicas dos vendedores é: {value}')

A quantidade de cidades únicas dos vendedores é: 611

### Qual o número total de pedidos únicos acima de R$ 3.500

In [13]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT oi.order_id)
  FROM
    order_items oi
  WHERE
    oi.price > 3500
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'Total de pedidos únicos acima de R$ 3.500,00 é: {value}')

Total de pedidos únicos acima de R$ 3.500,00 é: 18

### Qual o valor médio do preço de todos os pedidos?

In [14]:
cursor.execute(
  """
  SELECT
    AVG(oi.price)
  FROM
    order_items oi
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'O valor médio é: {value}')

O valor médio é: 120.65

### Qual o menor e o maior valor de preço entre todos os pedidos?

In [15]:
min_value = cursor.execute(
  """
  SELECT
    MIN(oi.price)
  FROM
    order_items oi
  """
)

rows = min_value.fetchall()
value = rows[0][0]
print(f'O menor preço é: {value}')

max_value = cursor.execute(
  """
  SELECT
    MAX(oi.price)
  FROM
    order_items oi
  """
)

rows = max_value.fetchall()
value = rows[0][0]
print(f'O menor preço é: {value}')

O menor preço é: 0.85
O menor preço é: 6735.0

### Qual a quantidade de produtos distintos vendidos abaixo do preço de R$ 100.00?

In [16]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT oi.product_id)
  FROM
    order_items oi
  WHERE oi.price < 100
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'Quantidade de produtos distintos abaixo dos R$ 100,00: {value}')

Quantidade de produtos distintos abaixo dos R$ 100,00: 20112

### Qual a quantidade de vendedores distintos que receberam algum pedido antes do dia 23 de setembro de 2016?

In [17]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT oi.seller_id)
  FROM
    order_items oi
  WHERE oi.shipping_limit_date < "2016-09-23"
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'{value} vendedores')

2 vendedores

### Quais os tipos de pagamentos existentes?

In [18]:
cursor.execute(
    """
    SELECT DISTINCT
      op.payment_type
    FROM
      order_payments op
    """
)

rows = cursor.fetchall()

rows_list = [row[0] for row in rows]

print(', '.join(rows_list))

credit_card, boleto, voucher, debit_card, not_defined

### Qual o maior e o menor número de parcelas realizado?

In [19]:
max_installments = cursor.execute(
  """
  SELECT
    MAX(op.payment_installments)
  FROM
    order_payments op
  """
)

rows = max_installments.fetchall()
value = rows[0][0]
print(f'{value} é a maior da quantidade de parcela')

min_installments = cursor.execute(
  """
  SELECT
    MIN(op.payment_installments)
  FROM
    order_payments op
  """
)

rows = min_installments.fetchall()
value = rows[0][0]
print(f'{value} é a menor da quantidade de parcela')

24 é a maior da quantidade de parcela
0 é a menor da quantidade de parcela

### Qual a média do valor pago no cartão de crédito?

In [20]:
cursor.execute(
  """
  SELECT
    AVG(op.payment_value)
  FROM
    order_payments op
  WHERE
    op.payment_type = "credit_card"
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'O valor médio é pago no cartão de crédito é de R$ {value}')

O valor médio é pago no cartão de crédito é de R$ 163.32

###  Quantos tipos de status para um pedido existem?

In [21]:
count_status = cursor.execute(
  """
  SELECT
    COUNT(DISTINCT o.order_status)
  FROM
    orders o
  """
)

rows = count_status.fetchall()
count_status = round(rows[0][0], 2)

name_status = cursor.execute(
  """
  SELECT DISTINCT
    o.order_status
  FROM
    orders o  
  """
)

rows = name_status.fetchall()
rows_list = [row[0] for row in rows]

print(f'Existem {count_status} status')
print(f'São eles: ' + ', '.join(rows_list))

Existem 8 status
São eles: delivered, invoiced, shipped, processing, unavailable, canceled, created, approved

  ### Quantos clientes distintos fizeram um pedido?

In [22]:
cursor.execute(
  """
  SELECT DISTINCT
    COUNT(DISTINCT o.customer_id)
  FROM
    orders o
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'{value} Clientes')

99441 Clientes

### Quantos produtos estão cadastrados na empresa?

In [23]:
cursor.execute(
  """
  SELECT DISTINCT
    COUNT(DISTINCT p.product_id)
  FROM
    products p
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'{value} Produtos cadastrados')

32951 Produtos cadastrados

### Qual a quantidade máxima de fotos de um produto?

In [24]:
cursor.execute(
  """
  SELECT DISTINCT
    MAX(p.product_photos_qty)
  FROM
    products p
  """
)

rows = cursor.fetchall()

value = round(rows[0][0])

print(f'{value} fotos')

20 fotos

### Qual o maior valor do peso entre todos os produtos?

In [25]:
cursor.execute(
  """
  SELECT DISTINCT
    MAX(p.product_weight_g)
  FROM
    products p
  """
)

rows = cursor.fetchall()

value = round(rows[0][0])

print(f'{value}g')

40425g

### Qual a altura média dos produtos?

In [26]:
cursor.execute(
  """
  SELECT
    AVG(DISTINCT p.product_height_cm)
  FROM
    products p
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'{value}cm')

52.67cm

## Ciclo_03

### Qual o número de clientes únicos de todos os estados?

In [27]:
cursor.execute(
  """
  SELECT
    c.customer_state,
    COUNT(DISTINCT c.customer_id) AS numero_clientes
  FROM
    customer c
  GROUP BY
    c.customer_state
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["estado", "qnt_clientes"])

display(df)

   estado  qnt_clientes
0      AC            81
1      AL           413
2      AM           148
3      AP            68
4      BA          3380
5      CE          1336
6      DF          2140
7      ES          2033
8      GO          2020
9      MA           747
10     MG         11635
11     MS           715
12     MT           907
13     PA           975
14     PB           536
15     PE          1652
16     PI           495
17     PR          5045
18     RJ         12852
19     RN           485
20     RO           253
21     RR            46
22     RS          5466
23     SC          3637
24     SE           350
25     SP         41746
26     TO           280

### Qual o número de cidades únicas de todos os estados?

In [28]:
cursor.execute(
  """
  SELECT
    c.customer_state,
    COUNT(DISTINCT c.customer_city) AS qnt_cidades
  FROM
    customer c
  GROUP BY
    c.customer_state
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["estado", "qnt_cidades"])

display(df)

   estado  qnt_cidades
0      AC            8
1      AL           68
2      AM            5
3      AP            6
4      BA          353
5      CE          161
6      DF            6
7      ES           95
8      GO          178
9      MA          122
10     MG          745
11     MS           67
12     MT          101
13     PA           89
14     PB           92
15     PE          152
16     PI           72
17     PR          364
18     RJ          149
19     RN           90
20     RO           35
21     RR            2
22     RS          379
23     SC          240
24     SE           46
25     SP          629
26     TO           56

### Qual o número de clientes únicos por estado e por cidade?

In [29]:
cursor.execute(
  """
  SELECT
    c.customer_state,
    c.customer_city,
    COUNT(DISTINCT c.customer_id) AS qnt_clientes
  FROM
    customer c
  GROUP BY
    c.customer_state,
    c.customer_city
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["estado", "cidade", "qnt_clientes"])

display(df)

     estado                   cidade  qnt_clientes
0        AC                brasileia             1
1        AC          cruzeiro do sul             3
2        AC           epitaciolandia             1
3        AC            manoel urbano             1
4        AC               porto acre             1
...     ...                      ...           ...
4305     TO             silvanopolis             1
4306     TO  sitio novo do tocantins             2
4307     TO               taguatinga             3
4308     TO           tocantinopolis             7
4309     TO                  xambioa             3

[4310 rows x 3 columns]

### Qual o número de clientes únicos por cidade e por estado?

In [30]:
cursor.execute(
  """
  SELECT
    c.customer_city,
    c.customer_state,
    COUNT(DISTINCT c.customer_id) AS qnt_clientes
  FROM
    customer c
  GROUP BY
    c.customer_city,
    c.customer_state
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["cidade", "estado", "qnt_clientes"])

display(df)

                   cidade estado  qnt_clientes
0     abadia dos dourados     MG             3
1               abadiania     GO             1
2                  abaete     MG            12
3              abaetetuba     PA            11
4                 abaiara     CE             2
...                   ...    ...           ...
4305             xinguara     PA             9
4306          xique-xique     BA             3
4307             zacarias     SP             2
4308              ze doca     MA             5
4309               zortea     SC             2

[4310 rows x 3 columns]

### Qual o número total de pedidos únicos acima de R$ 3.500 por cada vendedor?

In [31]:
cursor.execute(
  """
  SELECT
    oi.seller_id,
    COUNT(DISTINCT oi.order_id) AS qnt_pedidos
  FROM
    order_items oi
  WHERE
    oi.price > 3500
  GROUP BY
    oi.seller_id
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["vendedor", "qnt_pedidos"])

display(df)

                            vendedor  qnt_pedidos
0   039e6ad9dae79614493083e241147386            1
1   2bf6a2c1e71bbd29a4ad64e6d3c3629f            1
2   403aa86912527d730337ffcb0fb096ab            1
3   512d298ac2a96d1931b6bd30aa21f61d            1
4   585175ec331ea177fa47199e39a6170a            1
5   59417c56835dd8e2e72f91f809cd4092            3
6   80ceebb4ee9b31afb6c6a916a574a1e2            1
7   821fb029fc6e495ca4f08a35d51e53a5            2
8   abe021b01ba992245271b9aa422032df            1
9   c510bc1718f0f2961eaa42a23330681a            1
10  c72de06d72748d1a0dfb2125be43ba63            1
11  e3b4998c7a498169dc7bce44e6bb6277            1
12  ed4acab38528488b65a9a9c603ff024a            1
13  ee27a8f15b1dded4d213a468ba4eb391            1
14  fa1c13f2614d7b5c4749cbc52fecda94            1

### Qual o número total de pedidos únicos, a data mínima e máxima de envio, o valor máximo, mínimo e médio do frete dos pedidos acima de R$ 1.100 por cada vendedor?

In [32]:
cursor.execute(
  """
  SELECT
    oi.seller_id,
    COUNT(DISTINCT oi.order_id) AS qnt_pedidos,
    MIN(oi.shipping_limit_date) AS dt_min_envio,
    MAX(oi.shipping_limit_date) AS dt_max_envio,
    MIN(oi.freight_value) AS val_min_frete,
    MAX(oi.freight_value) AS val_max_frete,
    AVG(oi.freight_value) AS md_frete
  FROM
    order_items oi
  WHERE
    oi.price > 1100
  GROUP BY
    oi.seller_id
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["vendedor", "qnt_pedidos", "dt_min_envio", "dt_max_envio", "val_min_frete", "val_max_frete", "md_frete"])

display(df)

,vendedor,qnt_pedidos,dt_min_envio,dt_max_envio,val_min_frete,val_max_frete,md_frete
0,014c0679dd340a0e338872e7ec85666a,1,2018-02-08 13:49:36,2018-02-08 13:49:36,49.63,49.63,49.630000
1,02d35243ea2e497335cd0f076b45675d,1,2017-12-22 12:19:24,2017-12-22 12:19:24,97.32,97.32,97.320000
2,0307f7565ff85b299b6e5ef162b1b1a9,1,2017-03-06 12:05:26,2017-03-06 12:05:26,59.73,59.73,59.730000
3,039e6ad9dae79614493083e241147386,5,2018-04-09 11:49:03,2018-08-06 21:06:10,49.55,104.72,69.684000
4,04308b1ee57b6625f47df1d56f00eedf,13,2017-11-21 02:35:37,2018-07-24 21:50:27,24.55,70.29,39.393077
...,...,...,...,...,...,...,...
175,f9244d45189d3a3605499abddeade7d5,3,2017-04-14 07:54:19,2018-08-13 20:55:31,45.74,83.13,67.740000
176,fa1c13f2614d7b5c4749cbc52fecda94,10,2017-02-04 17:01:46,2018-05-10 16:13:33,15.96,27.75,20.512000
177,fbc14c0cf93505ef89f64665ffa4a7b5,4,2017-10-10 13:28:18,2018-08-08 19:35:19,25.64,70.70,42.885000
178,ff063b022a9a0aab91bad2c9088760b7,1,2018-08-22 16:30:44,2018-08-22 16:30:44,42.67,42.67,42.670000
179,ff69aa92bb6b1bf9b8b7a51c2ed9cf8b,6,2018-01-29 22:53:23,2018-06-14 16:19:31,37.26,254.55,128.230000

### Qual o valor médio, máximo e mínimo do preço de todos os pedidos de cada produto?

In [33]:
cursor.execute(
  """
SELECT
  oi.product_id,
  MIN(oi.price) AS val_min,
  MAX(oi.price) AS val_max,
  AVG(oi.price) AS val_med
FROM
  order_items oi
GROUP BY
  oi.product_id
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["produto", "val_min", "val_max", "val_med"])

display(df)

                                produto  val_min  val_max  val_med
0      00066f42aeeb9f3007548bb9d3f33c38   101.65   101.65   101.65
1      00088930e925c41fd95ebfe695fd2655   129.90   129.90   129.90
2      0009406fd7479715e4bef61dd91f2462   229.00   229.00   229.00
3      000b8f95fcb9e0096488278317764d19    58.90    58.90    58.90
4      000d9be29b5207b54e86aa1b1ac54872   199.00   199.00   199.00
...                                 ...      ...      ...      ...
32946  fff6177642830a9a94a0f2cba5e476d1   109.99   119.99   114.99
32947  fff81cc3158d2725c0655ab9ba0f712c    90.00    90.00    90.00
32948  fff9553ac224cec9d15d49f5a263411f    32.00    32.00    32.00
32949  fffdb2d0ec8d6a61f0a0a0db3f25b441    29.99    34.99    33.99
32950  fffe9eeff12fcbd74a2f2b007dde0c58   249.99   249.99   249.99

[32951 rows x 4 columns]

### Qual a quantidade de vendedores distintos que receberam algum pedido antes do dia 23 de setembro de 2016 e qual foi o preço médio desses pedidos?

In [34]:
cursor.execute(
  """
  SELECT
    oi.shipping_limit_date,
    COUNT(DISTINCT oi.seller_id) AS vendedor,
    AVG(oi.price) AS med_preco
  FROM
    order_items oi
  WHERE
    oi.shipping_limit_date < "2016-09-32"
  GROUP BY
    oi.shipping_limit_date
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["data", "vendedor", "med_preco"])

display(df)

                  data  vendedor  med_preco
0  2016-09-19 00:15:34         1      59.50
1  2016-09-19 23:11:33         1      44.99

### Qual a quantidade de pedidos por tipo de pagamentos?

In [35]:
cursor.execute(
  """
  SELECT
    op.payment_type,
    COUNT(op.order_id) AS pedidos
  FROM
    order_payments op
  GROUP BY
    op.payment_type
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["tipo_pagamento", "pedidos"])

display(df)

  tipo_pagamento  pedidos
0         boleto    19784
1    credit_card    76795
2     debit_card     1529
3    not_defined        3
4        voucher     5775

###  Qual a quantidade de pedidos, a média do valor do pagamento e o número máximo de parcelas por tipo de pagamentos?

In [36]:
cursor.execute(
  """
  SELECT
    op.payment_type,
    COUNT(op.order_id) AS pedidos,
    AVG(op.payment_value) AS med_valor,
    MAX(payment_installments) AS max_parcela
  FROM
    order_payments op
  GROUP BY
    op.payment_type
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["tipo_pagamento", "pedidos", "med_valor", "max_parcela"])

display(df)

  tipo_pagamento  pedidos   med_valor  max_parcela
0         boleto    19784  145.034435            1
1    credit_card    76795  163.319021           24
2     debit_card     1529  142.570170            1
3    not_defined        3    0.000000            1
4        voucher     5775   65.703354            1

### Qual a valor mínimo, máximo, médio e as soma total paga por cada tipo de pagamento e número de parcelas disponíveis?

In [37]:
cursor.execute(
  """
  SELECT
    op.payment_type,
    op.payment_installments,
    MIN(op.payment_value) AS min_val_parc,
    MAX(op.payment_value) AS max_val_parc,
    AVG(op.payment_value) AS med_val_parc,
    SUM(op.payment_value) AS som_val_parc
  FROM
    order_payments op
  GROUP BY
    op.payment_type,
    op.payment_installments
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["tipo_pagamento", "parcela", "min_val_parc", "max_val_parc", "med_val_parc", "som_val_parc"])

display(df)

,tipo_pagamento,parcela,min_val_parc,max_val_parc,med_val_parc,som_val_parc
0,boleto,1,11.62,7274.88,145.034435,2869361.27
1,credit_card,0,58.69,129.94,94.315000,188.63
2,credit_card,1,0.01,13664.08,95.872930,2440445.43
3,credit_card,2,20.03,2442.82,127.228150,1579283.03
4,credit_card,3,30.00,3256.14,142.539317,1491103.80
5,credit_card,4,40.00,3126.50,163.976840,1163907.61
6,credit_card,5,49.99,4809.44,183.465222,961174.30
7,credit_card,6,59.99,2828.42,209.849952,822611.81
8,credit_card,7,69.97,2094.44,187.673672,305157.39
9,credit_card,8,37.58,6929.31,307.737427,1313423.34
10,credit_card,9,90.11,2116.01,203.440870,131015.92
11,credit_card,10,37.67,4950.34,415.085837,2211577.34
12,credit_card,11,110.30,198.83,124.932174,2873.44
13,credit_card,12,121.09,1543.25,321.678496,42783.24
14,credit_card,13,130.00,278.00,150.462500,2407.40
15,credit_card,14,139.98,417.45,167.962667,2519.44
16,credit_card,15,151.93,2647.76,445.553108,32970.93
17,credit_card,16,160.12,651.05,292.694000,1463.47
18,credit_card,17,170.00,177.99,174.602500,1396.82
19,credit_card,18,180.76,1232.85,486.483333,13135.05
20,credit_card,20,200.08,2022.33,615.801765,10468.63
21,credit_card,21,212.03,303.02,243.700000,731.10
22,credit_card,22,228.71,228.71,228.710000,228.71
23,credit_card,23,236.48,236.48,236.480000,236.48
24,credit_card,24,241.42,1440.10,610.048889,10980.88
25,debit_card,1,13.38,4445.50,142.570170,217989.79
26,not_defined,1,0.00,0.00,0.000000,0.00
27,voucher,1,0.00,3184.34,65.703354,379436.87

### Qual a quantidade de pedidos por status?

In [38]:
cursor.execute(
  """
  SELECT
    o.order_status,
    COUNT(o.order_id) AS qnt_pedidos
  FROM
    orders o
  GROUP BY
    o.order_status
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["status", "qnt_pedidos"])

display(df)

        status  qnt_pedidos
0     approved            2
1     canceled          625
2      created            5
3    delivered        96478
4     invoiced          314
5   processing          301
6      shipped         1107
7  unavailable          609

### Qual a quantidade de pedidos realizados por dia, a partir do dia 23 de Setembro de 2016?

In [39]:
cursor.execute(
  """
  SELECT
    DATE (o.order_approved_at) AS ped_aprovado,
    COUNT(o.order_id) AS qnt_pedidos
  FROM
    orders o
  WHERE
    o.order_approved_at > "2016-09-23"
  GROUP BY
    DATE (o.order_approved_at)
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["ped_aprovado", "qnt_pedidos"])

display(df)

    ped_aprovado  qnt_pedidos
0     2016-10-04           20
1     2016-10-05           11
2     2016-10-06          110
3     2016-10-07           59
4     2016-10-08           26
..           ...          ...
605   2018-08-26           70
606   2018-08-27           64
607   2018-08-28           56
608   2018-08-29           15
609   2018-09-03            1

[610 rows x 2 columns]

### Quantos produtos estão cadastrados na empresa por categoria?

In [40]:
cursor.execute(
  """
  SELECT
    p.product_category_name,
    COUNT(p.product_id) AS produto
  FROM
    products p
  GROUP BY
    p.product_category_name
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["categoria", "qnt_produtos"])

display(df)

                    categoria  qnt_produtos
0                        None           610
1   agro_industria_e_comercio            74
2                   alimentos            82
3           alimentos_bebidas           104
4                       artes            55
..                        ...           ...
69    sinalizacao_e_seguranca            93
70   tablets_impressao_imagem             9
71                  telefonia          1134
72             telefonia_fixa           116
73      utilidades_domesticas          2335

[74 rows x 2 columns]

## Ciclo_04

### Qual o número de clientes únicos nos estado de Minas Gerais ou Rio de Janeiro?

In [41]:
cursor.execute(
  """
  SELECT
    c.customer_state,
    COUNT(DISTINCT c.customer_id) AS qnt_clientes
  FROM
    customer c
  WHERE
    c.customer_state = "MG"
    OR customer_state = "RJ"
  GROUP BY
    c.customer_state
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["estado", "qnt_clientes"])

display(df)

  estado  qnt_clientes
0     MG         11635
1     RJ         12852

### Qual a quantidade de cidades únicas dos vendedores no estado de São Paulo ou Rio de Janeiro com a latitude maior que -24.54 e longitude menor que -45.63?

In [42]:
cursor.execute(
  """
  SELECT
    g.geolocation_state,
    COUNT(DISTINCT g.geolocation_city)
  FROM
    geolocation g
  WHERE
    (
      g.geolocation_state = "SP"
      OR g.geolocation_state = "RJ"
    )
    AND (
      g.geolocation_lat > -24.54
      AND g.geolocation_lng < -45.63
    )
  GROUP BY
    g.geolocation_state
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["estado", "qnt_cidades"])

display(df)

  estado  qnt_cidades
0     RJ            9
1     SP          996

### Qual o número total de pedidos únicos, o número total de produtos e o preço médio dos pedidos com o preço de frete maior que R$ 20 e a data limite de envio entre os dias 1 e 31 de Outubro de 2016?

In [43]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT oi.order_id) AS qnt_pedidos,
    COUNT(DISTINCT oi.product_id) AS qnt_produtos,
    AVG(oi.price) AS med_preco
  FROM
    order_items oi
  WHERE
    (oi.freight_value > 20)
    AND (
      DATE (shipping_limit_date) >= "2016-10-01"
      AND DATE (shipping_limit_date) <= "2016-10-31"
    )
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["qnt_pedidos", "qnt_produtos", "med_preco"])

display(df)

   qnt_pedidos  qnt_produtos   med_preco
0          103            91  229.672308

### Mostre a quantidade total dos pedidos e o valor total do pagamento, para pagamentos entre 1 e 5 prestações ou um valor de pagamento acima de R$ 5000. Agrupe por quantidade de prestações.

In [44]:
cursor.execute(
  """
  SELECT
    op.payment_installments AS qnt_parcelas,
    COUNT(op.order_id) AS qnt_pedidos,
    SUM(op.payment_value) AS total_pag
  FROM
    order_payments op
  WHERE
    (
      op.payment_installments >= 1
      AND op.payment_installments <= 5
    )
    OR payment_value > 5000
  GROUP BY
    op.payment_installments
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["qnt_parcelas", "qnt_pedidos", "total_pag"])

display(df)

   qnt_parcelas  qnt_pedidos   total_pag
0             1        52546  5907233.36
1             2        12413  1579283.03
2             3        10461  1491103.80
3             4         7098  1163907.61
4             5         5239   961174.30
5             8            1     6929.31

###  Qual a quantidade de pedidos com o status em processamento ou cancelada acontecem com a data estimada de entrega maior que 01 de Janeiro de 2017 ou menor que 23 de Novembro de 2016?

In [45]:
cursor.execute(
  """
  SELECT
    o.order_status,
    COUNT(o.order_id) AS qnt_pedidos
  FROM
    orders o
  WHERE
    (
      o.order_status = "processing"
      OR o.order_status = "canceled"
    )
    AND (
      DATE (o.order_estimated_delivery_date) >= "2017-01-01"
      OR DATE (o.order_estimated_delivery_date) <= "2016-11-23"
    )
  GROUP BY
    o.order_status
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["status_pedido", "qnt_pedidos"])

display(df)

  status_pedido  qnt_pedidos
0      canceled          611
1    processing          299

### Quantos produtos estão cadastrados nas categorias: perfumaria, brinquedos, esporte lazer, cama mesa e banho e móveis de escritório que possuem mais de 5 fotos, um peso maior que 5 g, um altura maior que 10 cm, uma largura maior que 20 cm?

In [46]:
cursor.execute(
  """
  SELECT
    p.product_category_name AS cateagoria,
    COUNT(DISTINCT p.product_id) AS qnt_produtos
  FROM
    products p
  WHERE
    (
      product_category_name = "perfumaria"
      OR p.product_category_name = "brinquedos"
      OR p.product_category_name = "esporte_lazer"
      OR p.product_category_name = "cama_mesa_banho"
      OR p.product_category_name = "moveis_escritorio"
    )
    AND (
      p.product_photos_qty > 5
      AND p.product_weight_g > 5
      AND p.product_height_cm > 10
      AND p.product_width_cm > 20
    )
  GROUP BY
    p.product_category_name
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["categoria", "qnt_produtos"])

display(df)

           categoria  qnt_produtos
0         brinquedos            30
1    cama_mesa_banho            22
2      esporte_lazer            69
3  moveis_escritorio             7
4         perfumaria             6

## Ciclo_05

### Quantos clientes únicos tiveram seu pedidos com status de “processing”, “shipped” e “delivered”, feitos entre os dias 01 e 31 de Outubro de 2016. Mostrar o resultado somente se o número total de clientes for acima de 5.

In [47]:
cursor.execute(
  """
  SELECT
    o.order_status,
    COUNT(DISTINCT o.customer_id) AS qnt_clientes
  FROM
    orders o
  WHERE
    o.order_status IN ('processing', 'shipped', 'delivered')
    AND o.order_purchase_timestamp BETWEEN "2016-10-01" AND "2016-10-31"
  GROUP BY
    o.order_status
  HAVING
    COUNT(DISTINCT o.customer_id) > 5
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["status", "qnt_clientes"])

display(df)

      status  qnt_clientes
0  delivered           265
1    shipped             8

### Quantos produtos estão cadastrados nas categorias: perfumaria, brinquedos, esporte lazer e cama mesa, que possuem entre 5 e 10 fotos, um peso que não está entre 1 e 5 g, um altura maior que 10 cm, uma largura maior que 20 cm. Mostra somente as linhas com mais de 10 produtos únicos.

In [48]:
cursor.execute(
  """
  SELECT
    p.product_category_name,
    COUNT(p.product_id) AS qnt_produtos
  FROM
    products p
  WHERE
    p.product_category_name IN (
      "perfumaria",
      "brinquedos",
      "esporte_lazer",
      "cama_mesa_banho"
    )
    AND p.product_photos_qty BETWEEN 5 AND 10
    AND p.product_weight_g NOT BETWEEN 1 AND 5
    AND p.product_height_cm > 10
    AND P.product_width_cm > 20
  GROUP BY
    p.product_category_name
  HAVING
    COUNT(DISTINCT p.product_id) > 10
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["categoria", "qnt_produtos"])

display(df)

         categoria  qnt_produtos
0       brinquedos            68
1  cama_mesa_banho            34
2    esporte_lazer           112

### Mostre a quantidade total dos pedidos e o valor total do pagamento, para pagamentos entre 1 e 5 prestações ou um valor de pagamento acima de R$ 5000.

In [49]:
cursor.execute(
  """
  SELECT
    op.payment_installments,
    COUNT(op.order_id) AS qnt_pedidos,
    SUM(op.payment_value) AS total_pagamentos
  FROM
    order_payments op
  WHERE
    op.payment_installments BETWEEN 1 AND 5
    OR op.payment_value > 5000
  GROUP BY
    op.payment_installments
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["parcelas", "qnt_pedidos", "total_pagamentos"])

display(df)

   parcelas  qnt_pedidos  total_pagamentos
0         1        52546        5907233.36
1         2        12413        1579283.03
2         3        10461        1491103.80
3         4         7098        1163907.61
4         5         5239         961174.30
5         8            1           6929.31

### Refazer a consulta SQL abaixo, usando os operadores de intervalo.

SELECT
  order_status ,
COUNT( order_id ) AS pedidos
FROM orders o
WHERE ( order_status = 'processing' OR order_status = 'canceled' )
AND ( o.order_estimated_delivery_date > '2017-01-01' OR o.order_estimated_delivery_date < '2016-11-23' )
GROUP BY order_status

In [50]:
cursor.execute(
    """
  SELECT
    o.order_status,
    COUNT (order_id) AS pedidos
  FROM
    orders o
  WHERE
    o.order_status IN ("processing", "canceled")
    AND o.order_estimated_delivery_date NOT BETWEEN "2017-01-01" AND '2016-11-23'
  GROUP BY
    o.order_status
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["status", "qnt_pedidos"])

display(df)

       status  qnt_pedidos
0    canceled          625
1  processing          301

### Qual a quantidade de cidades únicas dos vendedores no estado de São Paulo ou Rio de Janeiro com a latitude maior que -24.54 e longitude menor que -45.63?

In [51]:
cursor.execute(
    """
  SELECT
    g.geolocation_state AS estados,
    COUNT(DISTINCT g.geolocation_city) AS qnt_cidades
  FROM
    geolocation g
  WHERE
    g.geolocation_state IN ("SP", "RJ")
    AND (
      g.geolocation_lat > -24.54
      AND g.geolocation_lng < -45.63
    )
  GROUP BY
    g.geolocation_state
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["estado", "qnt_cidades"])

display(df)

  estado  qnt_cidades
0     RJ            9
1     SP          996

###  Quantos produtos estão cadastrados em qualquer categorias que comece com a letra “a” e termine com a letra “o” e que possuem mais de 5 fotos? Mostrar as linhas com mais de 10 produtos.

In [52]:
cursor.execute(
    """
  SELECT
    P.product_category_name,
    COUNT(p.product_id) AS qnt_produtos
  FROM
    products p
  WHERE
    p.product_category_name LIKE 'a%o'
    AND p.product_photos_qty > 5
  GROUP BY
    p.product_category_name
  HAVING
    COUNT(p.product_category_name) > 10
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["categoria", "qnt_produtos"])

display(df)

    categoria  qnt_produtos
0  automotivo           172

### Qual o número de *clientes únicos*, agrupados por estado e por cidades que comecem com a letra “m”, tem a letra “o” e terminem com a letra “a”? Mostrar os resultados somente para o número de clientes únicos maior que 10.

In [53]:
cursor.execute(
    """
  SELECT
    c.customer_city AS cidade,
    c.customer_state AS estado,
    COUNT(c.customer_id) AS qnt_clientes
  FROM
    customer c
  WHERE
    c.customer_city LIKE "m%o%a"
  GROUP BY
    c.customer_state,
    c.customer_city
  HAVING
    COUNT(c.customer_id) > 10
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["cidade", "estado", "qnt_clientes"])

display(df)

                cidade estado  qnt_clientes
0       matias barbosa     MG            13
1            mairipora     SP            75
2               mococa     SP            34
3             mongagua     SP            42
4  monte azul paulista     SP            19

## Ciclo_06

### Gerar uma tabela de dados com 10 linhas, contendo o id do pedido, o id do cliente, o status do pedido, o id do produto e o preço do produto.

In [55]:
cursor.execute(
  """
  SELECT
    o.order_id AS id_pedido,
    o.customer_id AS id_cliente,
    o.order_status AS status_pedido,
    oi.product_id AS id_produto,
    oi.price AS preco
  FROM
    orders o
    INNER JOIN order_items oi ON (oi.order_id = o.order_id)
  LIMIT 10
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_pedido", "id_cliente", "status_pedido", "id_produto", "preco"])

display(df)

,id_pedido,id_cliente,status_pedido,id_produto,preco
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,87285b34884572647811a353c7ac498a,29.99
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,595fac2a385ac33a80bd5114aec74eb8,118.70
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,aa4383b373c6aca5d8797843e5594415,159.90
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,d0b61bfb1de832b15ba9d266ca96e5b0,45.00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,65266b2da20d04dbe00c5c2d3bb7859e,19.90
5,a4591c265e18cb1dcee52889e2d8acc3,503740e9ca751ccdda7ba28e9ab8f608,delivered,060cb19345d90064d1015407193c233d,147.90
6,136cce7faa42fdb2cefd53fdc79a6098,ed0271e0b7da060a393796590e7b737a,invoiced,a1804276d9941ac0733cfd409f5206eb,49.90
7,6514b8ad8028c9f2cc2374ded245783f,9bdf08b4b3b52b5526ff42d37d47f222,delivered,4520766ec412348b8d4caa5e8a18c464,59.99
8,76c6e866289321a7c93b82b54852dc33,f54a9f0e6b351c431402b8461ea51999,delivered,ac1789e492dcd698c5c10b97a671243a,19.90
9,e69bfb5eb88e0ed6a785585b27e16dbf,31ad1d1b63eb9962463f764d4e6e0c9d,delivered,9a78fb9862b10749a117f7fc3c31f051,149.99

### Gerar uma tabela de dados com 20 linhas, contendo o id do pedido, o estado do cliente, a cidade do cliente, o status do pedido, o id do produto e o preço do produto, somente para clientes do estado de São Paulo

In [56]:
cursor.execute(
  """
  SELECT
    o.order_id AS id_pedido,
    c.customer_state AS estado_cliente,
    c.customer_city AS cidade_cliente,
    o.order_status AS status_pedido,
    oi.product_id AS id_produto,
    oi.price AS preco
  FROM
    orders o
    INNER JOIN customer c ON (o.customer_id = c.customer_id)
    INNER JOIN order_items oi ON (o.order_id = oi.order_id)
  WHERE
    c.customer_state = "SP"
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_pedido", "estado_cliente", "cidade_cliente", "status_pedido", "id_produto", "preco"])

display(df)

,id_pedido,estado_cliente,cidade_cliente,status_pedido,id_produto,preco
0,00e7ee1b050b8499577073aeb2a297a1,SP,franca,delivered,a9516a079e37a9c9c36b9b78b10169e8,124.99
1,29150127e6685892b6eab3eec79f59c7,SP,sao bernardo do campo,delivered,4aa6014eceb682077f9dc4bffebc05b0,289.00
2,b2059ed67ce144a36e2aa97d2c9e9ad2,SP,sao paulo,delivered,bd07b66896d6f1494f5b86251848ced7,139.94
3,951670f92359f4fe4a63112aa7306eba,SP,mogi das cruzes,delivered,a5647c44af977b148e0a3a4751a09e2e,149.94
4,6b7d50bd145f6fc7f33cebabd7e49d0f,SP,campinas,delivered,9391a573abe00141c56e38d84d7d5b3b,230.00
...,...,...,...,...,...,...
47444,ca978d2459ea2c5ef6d5fde02be26b9c,SP,rio claro,delivered,163da86e86f0089de089399c28c3fcbb,99.00
47445,97d6c1727b0d36b8d04035e35d86f40f,SP,cajamar,delivered,e0d64dcfaa3b6db5c54ca298ae101d05,124.90
47446,6760e20addcf0121e9d58f2f1ff14298,SP,sao paulo,delivered,ccb4503d9d43d245d3b295d0544f988b,74.90
47447,9ec0c8947d973db4f4e8dcf1fbfa8f1b,SP,taboao da serra,delivered,9ede6b0570a75a4b9de4f383329f99ee,114.90
47448,28db69209a75e59f20ccbb5c36a20b90,SP,cotia,delivered,017692475c1c954ff597feda05131d73,13.99

### Gerar uma tabela de dados com 50 linhas, contendo o id do pedido, o estado e a cidade do cliente, o status do pedido, o nome da categoria do produto e o preço do produto, somente para pedidos com o status igual a cancelado.